# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireConduitType..::..Name Property
WireConduitType Class See Also
---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# See Also
WireConduitType Class
Autodesk.Revit.DB.Electrical Namespace